app/controllers/subjects_controller.rb

INSERT INTO `subjects` (`name`, `position`, `created_at`, `updated_at`) VALUES ('Default', 5, '2017-01-01 23:38:22', '2017-01-01 23:38:22')
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `position` = 4, `updated_at` = '2017-01-01 23:38:11' WHERE `subjects`.`id` = 1
---
  def update
    # Find a new object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)